In [147]:
#import necessary libraries
import pandas as pd
from sklearn.metrics import log_loss
import numpy as np

In [184]:
from sklearn.metrics import log_loss,f1_score,classification_report
data = pd.read_csv('Credit Default Dataset.csv')

In [185]:
data

,ID,SALARY,SEX,EDUCATION,MARRIAGE,AGE,AVERAGE PAYMENT DELAY,DEFAULT
0,1,"20,000.00",2,2,1,24,2,1
1,2,"120,000.00",2,2,2,26,-1,1
2,3,"90,000.00",2,2,2,34,0,0
3,4,"50,000.00",2,2,1,37,0,0
4,5,"50,000.00",1,2,1,57,-1,0
...,...,...,...,...,...,...,...,...
29158,29996,"220,000.00",1,3,1,39,0,0
29159,29997,"150,000.00",1,3,2,43,-1,0
29160,29998,"30,000.00",1,2,2,37,4,1
29161,29999,"80,000.00",1,3,1,41,1,1
29162,30000,"50,000.00",1,2,1,46,0,1

In [186]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29163 entries, 0 to 29162
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     29163 non-null  int64
 1   SALARY                 29163 non-null  object
 2   SEX                    29163 non-null  int64
 3   EDUCATION              29163 non-null  int64
 4   MARRIAGE               29163 non-null  int64
 5   AGE                    29163 non-null  int64
 6   AVERAGE PAYMENT DELAY  29163 non-null  int64
 7   DEFAULT                29163 non-null  int64
dtypes: int64(7), object(1)
memory usage: 1.7+ MB

In [187]:
data['AVERAGE PAYMENT DELAY'].unique()

array([ 2, -1,  0, -2,  1,  3,  4,  8,  7,  5,  6], dtype=int64)

In [188]:
data['SALARY'] = data['SALARY'].str.replace(',', '')
data['SALARY'] = data['SALARY'].astype(float)
data['AVERAGE PAYMENT DELAY'] = data['AVERAGE PAYMENT DELAY'].replace(0,-1)
data['AVERAGE PAYMENT DELAY'] = data['AVERAGE PAYMENT DELAY'].replace(-2,-1)

In [189]:
data

,ID,SALARY,SEX,EDUCATION,MARRIAGE,AGE,AVERAGE PAYMENT DELAY,DEFAULT
0,1,20000.0,2,2,1,24,2,1
1,2,120000.0,2,2,2,26,-1,1
2,3,90000.0,2,2,2,34,-1,0
3,4,50000.0,2,2,1,37,-1,0
4,5,50000.0,1,2,1,57,-1,0
...,...,...,...,...,...,...,...,...
29158,29996,220000.0,1,3,1,39,-1,0
29159,29997,150000.0,1,3,2,43,-1,0
29160,29998,30000.0,1,2,2,37,4,1
29161,29999,80000.0,1,3,1,41,1,1
29162,30000,50000.0,1,2,1,46,-1,1

In [190]:
data = pd.get_dummies(data,columns = ['SEX','MARRIAGE'],prefix_sep = '-',drop_first=True)

In [191]:
data

,ID,SALARY,EDUCATION,AGE,AVERAGE PAYMENT DELAY,DEFAULT,SEX-2,MARRIAGE-2
0,1,20000.0,2,24,2,1,1,0
1,2,120000.0,2,26,-1,1,1,1
2,3,90000.0,2,34,-1,0,1,1
3,4,50000.0,2,37,-1,0,1,0
4,5,50000.0,2,57,-1,0,0,0
...,...,...,...,...,...,...,...,...
29158,29996,220000.0,3,39,-1,0,0,0
29159,29997,150000.0,3,43,-1,0,0,1
29160,29998,30000.0,2,37,4,1,0,1
29161,29999,80000.0,3,41,1,1,0,0
29162,30000,50000.0,2,46,-1,1,0,0

In [192]:
X = data.drop(['ID','DEFAULT','AGE','MARRIAGE-2','SEX-2'],axis = 1)
y = data['DEFAULT']

In [198]:
X.columns

Index(['SALARY', 'EDUCATION', 'AVERAGE PAYMENT DELAY'], dtype='object')

In [195]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=30)

In [197]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier()
classifier.fit(X_train,y_train)
y_pred = classifier.predict(X_test)
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.83      0.95      0.89      7434
           1       0.68      0.32      0.44      2190

    accuracy                           0.81      9624
   macro avg       0.75      0.64      0.66      9624
weighted avg       0.79      0.81      0.78      9624

In [182]:
def input_to_dataframe(salary,sex,education,marriage,age,avg_pay_delay):
    X_dataframe = pd.DataFrame([{'SALARY':salary, 'SEX':sex, 'EDUCATION':education, 'MARRIAGE': marriage, 'AGE':age,'AVERAGE PAYMENT DELAY':avg_pay_delay}])
    return X_dataframe

In [183]:
input_to_dataframe('8282','2','1','3','45','-1')

  SALARY SEX EDUCATION MARRIAGE AGE AVERAGE PAYMENT DELAY
0   8282   2         1        3  45                    -1